In [6]:
import pandas as pd

In [7]:
dataset =pd.read_csv("data1.csv")
dataset.head(3)

   Gender   Age Nationality Married
0     NaN  25.0    American     NaN
1  Female  30.0     British      No
2    Male   NaN    Canadian     Yes

In [12]:
dataset.isnull().sum()

Gender         0
Age            7
Nationality    3
Married        0
dtype: int64

In [9]:
dataset["Gender"].fillna(dataset["Gender"].mode()[0],inplace=True)

In [11]:
dataset["Married"].fillna(dataset["Married"].mode()[0],inplace=True)

C:\Users\SHRAVANI\AppData\Local\Temp\ipykernel_19828\3070595742.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Married"].fillna(dataset["Married"].mode()[0],inplace=True)

In [ ]:
# get_dummise - pandas method

In [ ]:
en_data=dataset[["Gender","Married"]]

    Gender Married
0   Female      No
1   Female      No
2     Male     Yes
3     Male      No
4   Female     Yes
..     ...     ...
70  Female      No
71  Female     Yes
72  Female      No
73    Male      No
74  Female      No

[75 rows x 2 columns]

In [ ]:
pd.get_dummies(en_data).info()  #data give in binry form

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender_Female  75 non-null     bool
 1   Gender_Male    75 non-null     bool
 2   Married_No     75 non-null     bool
 3   Married_Yes    75 non-null     bool
dtypes: bool(4)
memory usage: 432.0 bytes

In [ ]:
# OneHotEncoder sklearn

In [16]:
from sklearn.preprocessing import OneHotEncoder

In [20]:
ohe =OneHotEncoder()
ar=ohe.fit_transform(en_data).toarray()  #direct data conver into numeric data

In [21]:
pd.DataFrame(ar, columns=["Gender_Female","Gender_Male"," Married_No "," Married_Yes "])

    Gender_Female  Gender_Male   Married_No    Married_Yes
0             1.0          0.0           1.0            0.0
1             1.0          0.0           1.0            0.0
2             0.0          1.0           0.0            1.0
3             0.0          1.0           1.0            0.0
4             1.0          0.0           0.0            1.0
..            ...          ...           ...            ...
70            1.0          0.0           1.0            0.0
71            1.0          0.0           0.0            1.0
72            1.0          0.0           1.0            0.0
73            0.0          1.0           1.0            0.0
74            1.0          0.0           1.0            0.0

[75 rows x 4 columns]